---
kind: enumMember
id: F:Autodesk.Revit.UI.DoubleClickAction.EnterEditMode
enum: Autodesk.Revit.UI.DoubleClickAction
source: html/b1d9dcb9-c1fb-12f5-16d3-edd16fb89ee3.htm
---
# Autodesk.Revit.UI.DoubleClickAction.EnterEditMode

Double-click will enter a specific edit mode for the element.